In [7]:
# Pandas dataframe is a 2 dimesnional data array or table with rows and columns
#To create a dataframe
import pandas as pd
carsData ={
    'Cars':['Voksawgen','Tesla','Vitz'],
    'Model':['Nano','Tesla-X','V8'],
    'Range':[300, 315, 400]
    }
df = pd.DataFrame(carsData)
df

        Cars    Model  Range
0  Voksawgen     Nano    300
1      Tesla  Tesla-X    315
2       Vitz       V8    400

In [8]:
#To access column operations on DataFrame
# Access a single column
df[['Cars']]

        Cars
0  Voksawgen
1      Tesla
2       Vitz

In [9]:
#Access multiple columns
df[['Cars','Range']]

        Cars  Range
0  Voksawgen    300
1      Tesla    315
2       Vitz    400

In [11]:
#Add a new column
df['Category'] = [5, 6, 7]
df

        Cars    Model  Range  Category
0  Voksawgen     Nano    300         5
1      Tesla  Tesla-X    315         6
2       Vitz       V8    400         7

In [12]:
#Drop a column
df.drop(columns=['Category'],inplace=True)
df

        Cars    Model  Range
0  Voksawgen     Nano    300
1      Tesla  Tesla-X    315
2       Vitz       V8    400

In [14]:
#Rename a column
df.rename(columns={'Model':'Make'}, inplace=True)
df

        Cars     Make  Range
0  Voksawgen     Nano    300
1      Tesla  Tesla-X    315
2       Vitz       V8    400

In [16]:
#To know the dimesnion of the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Cars    3 non-null      object
 1   Make    3 non-null      object
 2   Range   3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes